**
 დაწერეთ სკრიპტი რომელიც სთხოვს მომხმარებელს შეიყვანოს რიცხვი a (0 < a < 100).
თუ მომხმარებლის მიერ მოხდა რიცხვის არასწორედ შეტანა (სცდება დასაშვებ საზღვრებს – ნაკლები ან ტოლი 0 ან მეტი ან ტოლია 100) 
უნდა გამოვიდეს შეტყობინება ტექსტით „არასწორი შუალედი“. 
სწორი რიცხვის შეყვანის შემთხვევაში სკრიპტმა უნდა გამოიტანოს ყველა ლუწი ნატურალური რიცხვის ჯამი რომელიც ნაკლებია ამ რიცხვზე. 
 მაგალითად თუ მომხმარებელი შეიტანს რიცხვებს 7 სკრიპტმა უნდა გამოიტანოს 2 + 4 + 6 ჯამი.
 */

//ამ ფუნქციას გადაეცემა ციფრი და აბრუნებს ლუწია თუ არა. 
//ციფრს თუ ნაშთით გავყოფთ ორზე და ნაშთი იქნება 0 ე.ი ლუწია
function IsOdd(number) {
    return number % 2 == 0;
}

function Calculate() {
    var value = prompt("შეიყვანეთ რიცხვი 0 -დან  100 - მდე:");
    var number = parseInt(value);

    if (number <= 0 || number >= 100) {
        alert("არასწორი შუალედი");
        Calculate();
    } else {
        var sum = 0;
        for (var i = 2; i < number; i++) {
            if (IsOdd(i))
                sum += i;
        }

        document.writeln("პასუხი: ");
        document.writeln(sum);
    }
}

Calculate();